{"class_name": "Tokenizer", "config": {"num_words": 3000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 584, "word_counts": {"hola": 23, "bien": 4, "en": 19, "que": 220, "puedes": 16, "ayudarme": 1, "buenas": 4, "hey": 4, "como": 11, "estas": 5, "todo": 3, "adios": 1, "nos": 1, "vemos": 1, "buenos": 2, "dias": 2, "te": 3, "llamas": 2, "tienes": 3, "algun": 1, "nombre": 1, "quien": 1, "eres": 1, "hacer": 1, "gracias": 1, "perdon": 1, "lo": 1, "siento": 1, "hora": 4, "es": 128, "dime": 3, "la": 11, "dia": 5, "hoy": 3, "ayuda": 1, "estoy": 4, "triste": 1, "feliz": 1, "cuentame": 2, "un": 70, "chiste": 4, "otro": 2, "son": 16, "los": 7, "pajaros": 3, "pajaro": 2, "facebook": 4, "una": 24, "red": 1, "social": 4, "las": 8, "redes": 2, "sociales": 2, "personas": 1, "significa": 24, "compartir": 1, "conectar": 2, "twitter": 2, "por": 3, "no": 5, "usan": 5, "hace": 3, "abeja": 1, "el": 3, "gimnasio": 2, "zumba": 2, "abejas": 1, "hacen": 1, "animado": 1, "de": 66, "maravilla": 1, "cual": 2, "tenemos": 1, "si": 1, "disponible": 3, "sigues": 1, "me": 31, "ayudar": 2, "ayudas": 1, "ayudame": 1, "tal": 6, "escuchas": 1, "tardes": 1, "noches": 1, "va": 2, "haces": 1, "cuentas": 1, "tiempo": 2, "hablamos": 2, "ahi": 1, "para": 18, "hablar": 1, "puedo": 1, "preguntarte": 1, "algo": 1, "tu": 4, "tarde": 1, "has": 1, "estado": 1, "espero": 1, "estes": 1, "mucho": 1, "hasta": 1, "ahora": 1, "semana": 1, "amaneciste": 1, "existes": 1, "programacion": 8, "instrucciones": 11, "computadora": 2, "creacion": 1, "codigo": 4, "automatizar": 1, "dispositivo": 1, "electronico": 1, "procesar": 2, "informacion": 2, "almacenar": 1, "datos": 9, "util": 1, "conocimiento": 1, "derivado": 1, "tarea": 2, "automatica": 1, "pasos": 3, "organizados": 1, "tomar": 1, "decisiones": 1, "analizar": 1, "medio": 1, "digital": 2, "transformar": 2, "repetitiva": 2, "automatizable": 1, "reglas": 1, "organizadas": 1, "realizar": 2, "tareas": 2, "actividad": 1, "estructurada": 2, "identificar": 1, "patrones": 1, "conjunto": 5, "representacion": 1, "ser": 1, "ejecutadas": 1, "ordenes": 2, "mediante": 1, "software": 2, "ejecutando": 1, "resolver": 2, "problemas": 1, "con": 2, "escribir": 2, "modelo": 1, "ordenado": 1, "algoritmo": 18, "definido": 1, "manera": 1, "logica": 2, "problema": 1, "serie": 1, "escritos": 1, "interpretar": 1, "ejecutar": 1, "sirve": 4, "cuales": 8, "caracteristicas": 3, "tipos": 5, "algoritmos": 7, "recursivo": 1, "ejemplos": 17, "hay": 15, "recursivos": 1, "ordenamiento": 2, "mas": 1, "comunes": 1, "quicksort": 4, "complejidad": 1, "voraz": 1, "voraces": 2, "diferencia": 10, "entre": 11, "y": 13, "dinamicos": 2, "dinamico": 1, "tiene": 4, "instruccion": 3, "secuencial": 1, "formato": 1, "especifico": 1, "estructura": 1, "definida": 1, "modificar": 1, "optimizar": 1, "eficiencia": 1, "comparar": 1, "metodos": 1, "elegir": 2, "metodo": 1, "tecnica": 1, "adecuada": 1, "darme": 12, "secuenciales": 1, "condicional": 1, "condicionales": 1, "repetitivas": 1, "bucles": 1, "existen": 5, "bucle": 5, "for": 21, "while": 7, "do": 10, "entrada": 2, "salida": 2, "lenguaje": 12, "sintaxis": 1, "programa": 1, "codificar": 1, "traducir": 1, "lenguajes": 12, "bajo": 3, "nivel": 5, "dame": 2, "alto": 3, "compilado": 1, "compilados": 2, "interpretado": 1, "interpretados": 2, "e": 1, "orientado": 1, "a": 75, "objetos": 2, "orientados": 1, "funcional": 1, "funcionales": 1, "scripting": 4, "python": 14, "se": 16, "utiliza": 10, "java": 12, "javascript": 6, "c": 16, "ruby": 4, "kotlin": 4, "swift": 4, "rust": 4, "go": 4, "ventajas": 3, "desventajas": 1, "frameworks": 14, "framework": 2, "django": 4, "flask": 6, "inteligencia": 1, "artificial": 2, "spring": 6, "boot": 2, "hibernate": 4, "react": 10, "angular": 6, "vue": 2, "qt": 2, "desarrollo": 1, "movil": 1, "flutter": 2, "native": 2, "frontend": 10, "html": 2, "css": 2, "spa": 2, "backend": 10, "nodejs": 2, "api": 2, "rest": 2, "graphql": 2, "base": 5, "sql": 7, "comunican": 1, "full": 2, "stack": 2, "developer": 2, "bases": 1, "relacional": 2, "esquema": 1, "mysql": 2, "postgresql": 2, "server": 2, "mongodb": 6, "usa": 1, "redis": 4, "cassandra": 2, "diferencias": 1, "compilador": 1, "interprete": 1, "bug": 2, "debugger": 2, "variable": 2, "tipo": 7, "dato": 7, "primitivo": 1, "compuesto": 1, "array": 2, "lista": 1, "programaci\u00f3n": 1, "diccionario": 1, "tupla": 1, "string": 2, "booleano": 1, "valor": 1, "nulo": 1, "flotante": 1, "entero": 1, "char": 2, "complejo": 1, "funcion": 1, "recursion": 2, "hello": 22, "good": 7, "how": 13, "can": 18, "you": 38, "help": 5, "are": 35, "all": 1, "bye": 1, "see": 1, "morning": 2, "what": 210, "is": 156, "your": 6, "name": 3, "have": 9, "any": 1, "who": 1, "thank": 1, "sorry": 2, "im": 5, "time": 6, "it": 22, "tell": 6, "the": 28, "day": 5, "today": 3, "aid": 1, "sad": 1, "happy": 1, "joke": 4, "another": 2, "birds": 3, "bird": 2, "network": 1, "networks": 2, "people": 1, "does": 29, "mean": 24, "to": 23, "share": 1, "connecting": 1, "connect": 1, "why": 2, "dont": 1, "use": 1, "bee": 1, "in": 18, "gym": 2, "bees": 1, "on": 1, "encouraged": 1, "wonderful": 1, "we": 3, "yeah": 1, "available": 3, "still": 1, "hi": 2, "things": 1, "everything": 2, "fine": 1, "listening": 1, "afternoon": 2, "night": 1, "doing": 2, "whats": 1, "its": 1, "been": 2, "since": 1, "talked": 2, "hows": 2, "going": 2, "there": 5, "talk": 1, "i": 2, "ask": 1, "something": 1, "was": 2, "hope": 1, "well": 1, "havent": 1, "long": 1, "so": 1, "far": 1, "week": 1, "did": 1, "wake": 1, "up": 1, "exist": 6, "programming": 9, "instructions": 10, "computer": 2, "code": 5, "creation": 1, "automation": 1, "an": 23, "electronic": 1, "device": 1, "process": 2, "information": 2, "storing": 1, "data": 10, "useful": 1, "derived": 1, "knowledge": 1, "automatic": 1, "task": 2, "organized": 2, "steps": 3, "make": 1, "decisions": 1, "analyzing": 1, "medium": 1, "transform": 2, "which": 9, "repetitive": 3, "automatable": 1, "rules": 1, "perform": 2, "tasks": 2, "structured": 2, "activity": 1, "identifying": 1, "patterns": 1, "set": 5, "of": 33, "representation": 1, "be": 1, "executed": 1, "orders": 1, "using": 1, "executing": 1, "solving": 1, "problems": 1, "with": 2, "write": 2, "commands": 1, "ordered": 1, "model": 1, "algorithm": 18, "logically": 1, "defined": 2, "solve": 1, "problem": 1, "series": 1, "written": 1, "interpret": 1, "running": 1, "characteristics": 2, "types": 5, "algorithms": 7, "recursive": 2, "examples": 17, "sorting": 2, "most": 1, "common": 1, "complexity": 1, "greedy": 3, "difference": 10, "between": 11, "and": 14, "dynamic": 3, "sequential": 2, "instruction": 2, "specific": 1, "format": 1, "structure": 1, "modify": 1, "optimize": 1, "efficiency": 1, "compare": 1, "methods": 1, "choose": 2, "method": 1, "appropriate": 1, "technique": 1, "logic": 1, "give": 14, "conditional": 2, "statement": 1, "statements": 1, "loops": 1, "loop": 5, "input": 2, "output": 2, "language": 12, "syntax": 1, "program": 1, "translate": 1, "languages": 12, "low": 3, "level": 5, "high": 3, "compiled": 3, "interpreted": 3, "object": 1, "oriented": 1, "objectoriented": 1, "functional": 2, "used": 14, "\u200b\u200bused": 1, "advantages": 3, "disadvantages": 1, "features": 1, "intelligence": 1, "mobile": 1, "development": 1, "\u200b\u200bare": 2, "database": 5, "nonsql": 1, "communicate": 1, "databases": 1, "relational": 1, "nonrelational": 1, "schema": 1, "differences": 1, "compiler": 1, "interpreter": 1, "type": 7, "primitive": 1, "composite": 1, "list": 1, "dictionary": 1, "tuple": 1, "boolean": 1, "null": 1, "value": 1, "floating": 1, "integer": 1, "complex": 1, "function": 1}, "word_docs": {"hola": 23, "bien": 4, "ayudarme": 1, "que": 220, "puedes": 16, "en": 19, "buenas": 4, "hey": 4, "como": 11, "estas": 5, "todo": 3, "adios": 1, "vemos": 1, "nos": 1, "dias": 2, "buenos": 2, "llamas": 2, "te": 3, "tienes": 3, "algun": 1, "nombre": 1, "quien": 1, "eres": 1, "hacer": 1, "gracias": 1, "perdon": 1, "lo": 1, "siento": 1, "es": 128, "hora": 4, "dime": 3, "la": 11, "hoy": 3, "dia": 5, "ayuda": 1, "estoy": 4, "triste": 1, "feliz": 1, "chiste": 4, "un": 68, "cuentame": 2, "otro": 2, "son": 16, "los": 7, "pajaros": 3, "pajaro": 2, "facebook": 4, "una": 24, "red": 1, "social": 4, "sociales": 2, "las": 8, "redes": 2, "personas": 1, "significa": 24, "compartir": 1, "conectar": 2, "twitter": 2, "por": 3, "usan": 5, "no": 5, "gimnasio": 2, "el": 3, "hace": 3, "abeja": 1, "zumba": 2, "abejas": 1, "hacen": 1, "animado": 1, "maravilla": 1, "de": 59, "cual": 2, "tenemos": 1, "si": 1, "disponible": 3, "sigues": 1, "ayudar": 2, "me": 31, "ayudas": 1, "ayudame": 1, "tal": 6, "escuchas": 1, "tardes": 1, "noches": 1, "va": 2, "haces": 1, "cuentas": 1, "hablamos": 2, "tiempo": 2, "ahi": 1, "hablar": 1, "para": 18, "preguntarte": 1, "algo": 1, "puedo": 1, "tu": 4, "tarde": 1, "has": 1, "estado": 1, "estes": 1, "espero": 1, "mucho": 1, "ahora": 1, "hasta": 1, "semana": 1, "amaneciste": 1, "existes": 1, "programacion": 8, "instrucciones": 11, "computadora": 2, "creacion": 1, "codigo": 4, "automatizar": 1, "dispositivo": 1, "electronico": 1, "procesar": 2, "informacion": 2, "datos": 9, "almacenar": 1, "util": 1, "derivado": 1, "conocimiento": 1, "automatica": 1, "tarea": 2, "pasos": 3, "organizados": 1, "tomar": 1, "decisiones": 1, "analizar": 1, "digital": 2, "medio": 1, "transformar": 2, "repetitiva": 2, "automatizable": 1, "organizadas": 1, "reglas": 1, "tareas": 2, "realizar": 2, "actividad": 1, "estructurada": 2, "patrones": 1, "identificar": 1, "conjunto": 5, "representacion": 1, "ser": 1, "ejecutadas": 1, "ordenes": 2, "software": 2, "mediante": 1, "ejecutando": 1, "con": 2, "resolver": 2, "problemas": 1, "escribir": 2, "modelo": 1, "ordenado": 1, "algoritmo": 18, "logica": 2, "definido": 1, "manera": 1, "problema": 1, "escritos": 1, "serie": 1, "interpretar": 1, "ejecutar": 1, "sirve": 4, "cuales": 8, "caracteristicas": 3, "algoritmos": 7, "tipos": 5, "recursivo": 1, "ejemplos": 17, "recursivos": 1, "hay": 15, "ordenamiento": 2, "comunes": 1, "mas": 1, "quicksort": 4, "complejidad": 1, "voraz": 1, "voraces": 2, "entre": 11, "diferencia": 10, "dinamicos": 2, "y": 13, "dinamico": 1, "tiene": 4, "instruccion": 3, "secuencial": 1, "formato": 1, "especifico": 1, "definida": 1, "estructura": 1, "modificar": 1, "optimizar": 1, "eficiencia": 1, "comparar": 1, "metodos": 1, "elegir": 2, "metodo": 1, "tecnica": 1, "adecuada": 1, "darme": 12, "secuenciales": 1, "condicional": 1, "condicionales": 1, "repetitivas": 1, "bucles": 1, "existen": 5, "bucle": 5, "for": 21, "while": 7, "do": 10, "entrada": 2, "salida": 2, "lenguaje": 12, "sintaxis": 1, "programa": 1, "codificar": 1, "traducir": 1, "lenguajes": 12, "nivel": 5, "bajo": 3, "dame": 2, "alto": 3, "compilado": 1, "compilados": 2, "interpretado": 1, "interpretados": 2, "e": 1, "objetos": 2, "a": 73, "orientado": 1, "orientados": 1, "funcional": 1, "funcionales": 1, "scripting": 4, "python": 14, "utiliza": 10, "se": 16, "java": 12, "javascript": 6, "c": 14, "ruby": 4, "kotlin": 4, "swift": 4, "rust": 4, "go": 4, "ventajas": 3, "desventajas": 1, "frameworks": 14, "framework": 2, "django": 4, "flask": 6, "inteligencia": 1, "artificial": 2, "spring": 6, "boot": 2, "hibernate": 4, "react": 10, "angular": 6, "vue": 2, "qt": 2, "movil": 1, "desarrollo": 1, "flutter": 2, "native": 2, "frontend": 10, "html": 2, "css": 2, "spa": 2, "backend": 10, "nodejs": 2, "api": 2, "rest": 2, "graphql": 2, "base": 5, "sql": 6, "comunican": 1, "stack": 2, "developer": 2, "full": 2, "bases": 1, "relacional": 2, "esquema": 1, "mysql": 2, "postgresql": 2, "server": 2, "mongodb": 6, "usa": 1, "redis": 4, "cassandra": 2, "diferencias": 1, "compilador": 1, "interprete": 1, "bug": 2, "debugger": 2, "variable": 2, "tipo": 7, "dato": 7, "primitivo": 1, "compuesto": 1, "array": 2, "programaci\u00f3n": 1, "lista": 1, "diccionario": 1, "tupla": 1, "string": 2, "booleano": 1, "valor": 1, "nulo": 1, "flotante": 1, "entero": 1, "char": 2, "complejo": 1, "funcion": 1, "recursion": 2, "hello": 22, "good": 7, "you": 38, "how": 13, "help": 5, "can": 18, "are": 35, "all": 1, "bye": 1, "see": 1, "morning": 2, "is": 156, "what": 210, "your": 6, "name": 3, "any": 1, "have": 9, "who": 1, "thank": 1, "sorry": 2, "im": 5, "time": 6, "it": 22, "tell": 6, "the": 28, "day": 5, "today": 3, "aid": 1, "sad": 1, "happy": 1, "joke": 4, "another": 2, "birds": 3, "bird": 2, "network": 1, "networks": 2, "people": 1, "does": 29, "share": 1, "to": 23, "mean": 24, "connecting": 1, "connect": 1, "use": 1, "why": 2, "dont": 1, "bee": 1, "in": 18, "gym": 2, "bees": 1, "on": 1, "encouraged": 1, "wonderful": 1, "we": 3, "yeah": 1, "available": 3, "still": 1, "hi": 2, "things": 1, "fine": 1, "everything": 2, "listening": 1, "afternoon": 2, "night": 1, "doing": 2, "whats": 1, "its": 1, "been": 2, "talked": 2, "since": 1, "there": 5, "hows": 2, "going": 2, "talk": 1, "ask": 1, "something": 1, "i": 2, "was": 2, "hope": 1, "well": 1, "long": 1, "havent": 1, "so": 1, "far": 1, "week": 1, "up": 1, "wake": 1, "did": 1, "exist": 6, "programming": 9, "instructions": 10, "computer": 2, "creation": 1, "code": 5, "automation": 1, "device": 1, "electronic": 1, "an": 23, "process": 2, "information": 2, "data": 10, "storing": 1, "useful": 1, "derived": 1, "knowledge": 1, "task": 2, "automatic": 1, "organized": 2, "steps": 3, "make": 1, "decisions": 1, "analyzing": 1, "medium": 1, "transform": 2, "which": 9, "repetitive": 3, "automatable": 1, "rules": 1, "tasks": 2, "perform": 2, "activity": 1, "structured": 2, "patterns": 1, "identifying": 1, "set": 5, "of": 33, "representation": 1, "executed": 1, "be": 1, "orders": 1, "using": 1, "executing": 1, "solving": 1, "with": 2, "problems": 1, "commands": 1, "write": 2, "ordered": 1, "model": 1, "algorithm": 18, "logically": 1, "defined": 2, "problem": 1, "solve": 1, "written": 1, "series": 1, "interpret": 1, "running": 1, "characteristics": 2, "types": 5, "algorithms": 7, "recursive": 2, "examples": 17, "sorting": 2, "most": 1, "common": 1, "complexity": 1, "greedy": 3, "difference": 10, "and": 14, "between": 11, "dynamic": 3, "sequential": 2, "instruction": 2, "format": 1, "specific": 1, "structure": 1, "modify": 1, "optimize": 1, "efficiency": 1, "methods": 1, "compare": 1, "choose": 2, "method": 1, "technique": 1, "appropriate": 1, "logic": 1, "give": 14, "statement": 1, "conditional": 2, "statements": 1, "loops": 1, "loop": 5, "output": 2, "input": 2, "language": 12, "syntax": 1, "program": 1, "translate": 1, "languages": 12, "level": 5, "low": 3, "high": 3, "compiled": 3, "interpreted": 3, "oriented": 1, "object": 1, "objectoriented": 1, "functional": 2, "used": 14, "\u200b\u200bused": 1, "advantages": 3, "disadvantages": 1, "features": 1, "intelligence": 1, "mobile": 1, "development": 1, "\u200b\u200bare": 2, "database": 5, "nonsql": 1, "communicate": 1, "databases": 1, "relational": 1, "nonrelational": 1, "schema": 1, "differences": 1, "compiler": 1, "interpreter": 1, "type": 7, "primitive": 1, "composite": 1, "list": 1, "dictionary": 1, "tuple": 1, "boolean": 1, "null": 1, "value": 1, "floating": 1, "integer": 1, "complex": 1, "function": 1}, "index_docs": {"17": 23, "109": 4, "274": 1, "1": 220, "31": 16, "23": 19, "110": 4, "111": 4, "49": 11, "89": 5, "132": 3, "275": 1, "277": 1, "276": 1, "163": 2, "162": 2, "164": 2, "133": 3, "134": 3, "278": 1, "279": 1, "280": 1, "281": 1, "282": 1, "283": 1, "284": 1, "285": 1, "286": 1, "4": 128, "112": 4, "135": 3, "50": 11, "136": 3, "90": 5, "287": 1, "113": 4, "288": 1, "289": 1, "114": 4, "6": 68, "165": 2, "166": 2, "32": 16, "70": 7, "137": 3, "167": 2, "115": 4, "14": 24, "290": 1, "116": 4, "169": 2, "67": 8, "168": 2, "291": 1, "15": 24, "292": 1, "170": 2, "171": 2, "138": 3, "92": 5, "91": 5, "172": 2, "140": 3, "139": 3, "293": 1, "173": 2, "294": 1, "295": 1, "296": 1, "297": 1, "7": 59, "174": 2, "298": 1, "299": 1, "141": 3, "300": 1, "175": 2, "11": 31, "301": 1, "302": 1, "79": 6, "303": 1, "304": 1, "305": 1, "176": 2, "306": 1, "307": 1, "178": 2, "177": 2, "308": 1, "309": 1, "24": 18, "311": 1, "312": 1, "310": 1, "117": 4, "313": 1, "314": 1, "315": 1, "317": 1, "316": 1, "318": 1, "320": 1, "319": 1, "321": 1, "322": 1, "323": 1, "68": 8, "51": 11, "179": 2, "324": 1, "118": 4, "325": 1, "326": 1, "327": 1, "180": 2, "181": 2, "63": 9, "328": 1, "329": 1, "331": 1, "330": 1, "332": 1, "182": 2, "142": 3, "333": 1, "334": 1, "335": 1, "336": 1, "183": 2, "337": 1, "184": 2, "185": 2, "338": 1, "340": 1, "339": 1, "187": 2, "186": 2, "341": 1, "188": 2, "343": 1, "342": 1, "93": 5, "344": 1, "345": 1, "346": 1, "189": 2, "190": 2, "347": 1, "348": 1, "192": 2, "191": 2, "349": 1, "193": 2, "350": 1, "351": 1, "25": 18, "194": 2, "352": 1, "353": 1, "354": 1, "356": 1, "355": 1, "357": 1, "358": 1, "119": 4, "69": 8, "143": 3, "71": 7, "94": 5, "359": 1, "29": 17, "360": 1, "35": 15, "195": 2, "362": 1, "361": 1, "120": 4, "363": 1, "364": 1, "196": 2, "52": 11, "54": 10, "197": 2, "41": 13, "365": 1, "121": 4, "144": 3, "366": 1, "367": 1, "368": 1, "370": 1, "369": 1, "371": 1, "372": 1, "373": 1, "374": 1, "375": 1, "198": 2, "376": 1, "377": 1, "378": 1, "43": 12, "379": 1, "380": 1, "381": 1, "382": 1, "383": 1, "95": 5, "96": 5, "22": 21, "72": 7, "55": 10, "199": 2, "200": 2, "44": 12, "384": 1, "385": 1, "386": 1, "387": 1, "45": 12, "97": 5, "145": 3, "201": 2, "146": 3, "388": 1, "202": 2, "389": 1, "203": 2, "390": 1, "204": 2, "5": 73, "391": 1, "392": 1, "393": 1, "394": 1, "122": 4, "36": 14, "56": 10, "33": 16, "46": 12, "80": 6, "34": 14, "123": 4, "124": 4, "125": 4, "126": 4, "127": 4, "147": 3, "395": 1, "37": 14, "205": 2, "128": 4, "81": 6, "396": 1, "206": 2, "82": 6, "207": 2, "129": 4, "57": 10, "83": 6, "208": 2, "209": 2, "398": 1, "397": 1, "210": 2, "211": 2, "58": 10, "212": 2, "213": 2, "214": 2, "59": 10, "215": 2, "216": 2, "217": 2, "218": 2, "98": 5, "73": 6, "399": 1, "220": 2, "221": 2, "219": 2, "400": 1, "222": 2, "401": 1, "223": 2, "224": 2, "225": 2, "84": 6, "402": 1, "130": 4, "226": 2, "403": 1, "404": 1, "405": 1, "227": 2, "228": 2, "229": 2, "74": 7, "75": 7, "406": 1, "407": 1, "230": 2, "409": 1, "408": 1, "410": 1, "411": 1, "231": 2, "412": 1, "413": 1, "414": 1, "415": 1, "416": 1, "232": 2, "417": 1, "418": 1, "233": 2, "20": 22, "76": 7, "8": 38, "42": 13, "99": 5, "26": 18, "9": 35, "419": 1, "420": 1, "421": 1, "234": 2, "3": 156, "2": 210, "85": 6, "148": 3, "422": 1, "64": 9, "423": 1, "424": 1, "235": 2, "100": 5, "86": 6, "21": 22, "87": 6, "13": 28, "101": 5, "149": 3, "425": 1, "426": 1, "427": 1, "131": 4, "236": 2, "150": 3, "237": 2, "428": 1, "238": 2, "429": 1, "12": 29, "430": 1, "18": 23, "16": 24, "431": 1, "432": 1, "434": 1, "239": 2, "433": 1, "435": 1, "27": 18, "240": 2, "436": 1, "437": 1, "438": 1, "439": 1, "151": 3, "440": 1, "152": 3, "441": 1, "241": 2, "442": 1, "443": 1, "242": 2, "444": 1, "243": 2, "445": 1, "244": 2, "446": 1, "447": 1, "245": 2, "246": 2, "448": 1, "102": 5, "247": 2, "248": 2, "449": 1, "450": 1, "451": 1, "249": 2, "250": 2, "452": 1, "453": 1, "455": 1, "454": 1, "456": 1, "457": 1, "458": 1, "461": 1, "460": 1, "459": 1, "88": 6, "65": 9, "60": 10, "251": 2, "462": 1, "103": 5, "463": 1, "465": 1, "464": 1, "19": 23, "252": 2, "253": 2, "61": 10, "466": 1, "467": 1, "468": 1, "469": 1, "254": 2, "470": 1, "255": 2, "153": 3, "471": 1, "472": 1, "473": 1, "474": 1, "256": 2, "66": 9, "154": 3, "475": 1, "476": 1, "258": 2, "257": 2, "477": 1, "259": 2, "479": 1, "478": 1, "104": 5, "10": 33, "480": 1, "482": 1, "481": 1, "483": 1, "484": 1, "485": 1, "486": 1, "260": 2, "487": 1, "488": 1, "261": 2, "489": 1, "490": 1, "28": 18, "491": 1, "262": 2, "493": 1, "492": 1, "495": 1, "494": 1, "496": 1, "497": 1, "263": 2, "105": 5, "77": 7, "264": 2, "30": 17, "265": 2, "498": 1, "499": 1, "500": 1, "155": 3, "62": 10, "38": 14, "53": 11, "156": 3, "266": 2, "267": 2, "502": 1, "501": 1, "503": 1, "504": 1, "505": 1, "506": 1, "508": 1, "507": 1, "268": 2, "509": 1, "511": 1, "510": 1, "512": 1, "39": 14, "513": 1, "269": 2, "514": 1, "515": 1, "106": 5, "271": 2, "270": 2, "47": 12, "516": 1, "517": 1, "518": 1, "48": 12, "107": 5, "157": 3, "158": 3, "159": 3, "160": 3, "520": 1, "519": 1, "521": 1, "272": 2, "40": 14, "522": 1, "161": 3, "523": 1, "524": 1, "525": 1, "526": 1, "527": 1, "273": 2, "108": 5, "528": 1, "529": 1, "530": 1, "531": 1, "532": 1, "533": 1, "534": 1, "535": 1, "536": 1, "78": 7, "537": 1, "538": 1, "539": 1, "540": 1, "541": 1, "542": 1, "543": 1, "544": 1, "545": 1, "546": 1, "547": 1, "548": 1}, "index_word": {"1": "que", "2": "what", "3": "is", "4": "es", "5": "a", "6": "un", "7": "de", "8": "you", "9": "are", "10": "of", "11": "me", "12": "does", "13": "the", "14": "una", "15": "significa", "16": "mean", "17": "hola", "18": "to", "19": "an", "20": "hello", "21": "it", "22": "for", "23": "en", "24": "para", "25": "algoritmo", "26": "can", "27": "in", "28": "algorithm", "29": "ejemplos", "30": "examples", "31": "puedes", "32": "son", "33": "se", "34": "c", "35": "hay", "36": "python", "37": "frameworks", "38": "and", "39": "give", "40": "used", "41": "y", "42": "how", "43": "darme", "44": "lenguaje", "45": "lenguajes", "46": "java", "47": "language", "48": "languages", "49": "como", "50": "la", "51": "instrucciones", "52": "entre", "53": "between", "54": "diferencia", "55": "do", "56": "utiliza", "57": "react", "58": "frontend", "59": "backend", "60": "instructions", "61": "data", "62": "difference", "63": "datos", "64": "have", "65": "programming", "66": "which", "67": "las", "68": "programacion", "69": "cuales", "70": "los", "71": "algoritmos", "72": "while", "73": "sql", "74": "tipo", "75": "dato", "76": "good", "77": "algorithms", "78": "type", "79": "tal", "80": "javascript", "81": "flask", "82": "spring", "83": "angular", "84": "mongodb", "85": "your", "86": "time", "87": "tell", "88": "exist", "89": "estas", "90": "dia", "91": "no", "92": "usan", "93": "conjunto", "94": "tipos", "95": "existen", "96": "bucle", "97": "nivel", "98": "base", "99": "help", "100": "im", "101": "day", "102": "there", "103": "code", "104": "set", "105": "types", "106": "loop", "107": "level", "108": "database", "109": "bien", "110": "buenas", "111": "hey", "112": "hora", "113": "estoy", "114": "chiste", "115": "facebook", "116": "social", "117": "tu", "118": "codigo", "119": "sirve", "120": "quicksort", "121": "tiene", "122": "scripting", "123": "ruby", "124": "kotlin", "125": "swift", "126": "rust", "127": "go", "128": "django", "129": "hibernate", "130": "redis", "131": "joke", "132": "todo", "133": "te", "134": "tienes", "135": "dime", "136": "hoy", "137": "pajaros", "138": "por", "139": "hace", "140": "el", "141": "disponible", "142": "pasos", "143": "caracteristicas", "144": "instruccion", "145": "bajo", "146": "alto", "147": "ventajas", "148": "name", "149": "today", "150": "birds", "151": "we", "152": "available", "153": "steps", "154": "repetitive", "155": "greedy", "156": "dynamic", "157": "low", "158": "high", "159": "compiled", "160": "interpreted", "161": "advantages", "162": "buenos", "163": "dias", "164": "llamas", "165": "cuentame", "166": "otro", "167": "pajaro", "168": "redes", "169": "sociales", "170": "conectar", "171": "twitter", "172": "gimnasio", "173": "zumba", "174": "cual", "175": "ayudar", "176": "va", "177": "tiempo", "178": "hablamos", "179": "computadora", "180": "procesar", "181": "informacion", "182": "tarea", "183": "digital", "184": "transformar", "185": "repetitiva", "186": "realizar", "187": "tareas", "188": "estructurada", "189": "ordenes", "190": "software", "191": "resolver", "192": "con", "193": "escribir", "194": "logica", "195": "ordenamiento", "196": "voraces", "197": "dinamicos", "198": "elegir", "199": "entrada", "200": "salida", "201": "dame", "202": "compilados", "203": "interpretados", "204": "objetos", "205": "framework", "206": "artificial", "207": "boot", "208": "vue", "209": "qt", "210": "flutter", "211": "native", "212": "html", "213": "css", "214": "spa", "215": "nodejs", "216": "api", "217": "rest", "218": "graphql", "219": "full", "220": "stack", "221": "developer", "222": "relacional", "223": "mysql", "224": "postgresql", "225": "server", "226": "cassandra", "227": "bug", "228": "debugger", "229": "variable", "230": "array", "231": "string", "232": "char", "233": "recursion", "234": "morning", "235": "sorry", "236": "another", "237": "bird", "238": "networks", "239": "why", "240": "gym", "241": "hi", "242": "everything", "243": "afternoon", "244": "doing", "245": "been", "246": "talked", "247": "hows", "248": "going", "249": "i", "250": "was", "251": "computer", "252": "process", "253": "information", "254": "task", "255": "organized", "256": "transform", "257": "perform", "258": "tasks", "259": "structured", "260": "with", "261": "write", "262": "defined", "263": "characteristics", "264": "recursive", "265": "sorting", "266": "sequential", "267": "instruction", "268": "choose", "269": "conditional", "270": "input", "271": "output", "272": "functional", "273": "\u200b\u200bare", "274": "ayudarme", "275": "adios", "276": "nos", "277": "vemos", "278": "algun", "279": "nombre", "280": "quien", "281": "eres", "282": "hacer", "283": "gracias", "284": "perdon", "285": "lo", "286": "siento", "287": "ayuda", "288": "triste", "289": "feliz", "290": "red", "291": "personas", "292": "compartir", "293": "abeja", "294": "abejas", "295": "hacen", "296": "animado", "297": "maravilla", "298": "tenemos", "299": "si", "300": "sigues", "301": "ayudas", "302": "ayudame", "303": "escuchas", "304": "tardes", "305": "noches", "306": "haces", "307": "cuentas", "308": "ahi", "309": "hablar", "310": "puedo", "311": "preguntarte", "312": "algo", "313": "tarde", "314": "has", "315": "estado", "316": "espero", "317": "estes", "318": "mucho", "319": "hasta", "320": "ahora", "321": "semana", "322": "amaneciste", "323": "existes", "324": "creacion", "325": "automatizar", "326": "dispositivo", "327": "electronico", "328": "almacenar", "329": "util", "330": "conocimiento", "331": "derivado", "332": "automatica", "333": "organizados", "334": "tomar", "335": "decisiones", "336": "analizar", "337": "medio", "338": "automatizable", "339": "reglas", "340": "organizadas", "341": "actividad", "342": "identificar", "343": "patrones", "344": "representacion", "345": "ser", "346": "ejecutadas", "347": "mediante", "348": "ejecutando", "349": "problemas", "350": "modelo", "351": "ordenado", "352": "definido", "353": "manera", "354": "problema", "355": "serie", "356": "escritos", "357": "interpretar", "358": "ejecutar", "359": "recursivo", "360": "recursivos", "361": "mas", "362": "comunes", "363": "complejidad", "364": "voraz", "365": "dinamico", "366": "secuencial", "367": "formato", "368": "especifico", "369": "estructura", "370": "definida", "371": "modificar", "372": "optimizar", "373": "eficiencia", "374": "comparar", "375": "metodos", "376": "metodo", "377": "tecnica", "378": "adecuada", "379": "secuenciales", "380": "condicional", "381": "condicionales", "382": "repetitivas", "383": "bucles", "384": "sintaxis", "385": "programa", "386": "codificar", "387": "traducir", "388": "compilado", "389": "interpretado", "390": "e", "391": "orientado", "392": "orientados", "393": "funcional", "394": "funcionales", "395": "desventajas", "396": "inteligencia", "397": "desarrollo", "398": "movil", "399": "comunican", "400": "bases", "401": "esquema", "402": "usa", "403": "diferencias", "404": "compilador", "405": "interprete", "406": "primitivo", "407": "compuesto", "408": "lista", "409": "programaci\u00f3n", "410": "diccionario", "411": "tupla", "412": "booleano", "413": "valor", "414": "nulo", "415": "flotante", "416": "entero", "417": "complejo", "418": "funcion", "419": "all", "420": "bye", "421": "see", "422": "any", "423": "who", "424": "thank", "425": "aid", "426": "sad", "427": "happy", "428": "network", "429": "people", "430": "share", "431": "connecting", "432": "connect", "433": "dont", "434": "use", "435": "bee", "436": "bees", "437": "on", "438": "encouraged", "439": "wonderful", "440": "yeah", "441": "still", "442": "things", "443": "fine", "444": "listening", "445": "night", "446": "whats", "447": "its", "448": "since", "449": "talk", "450": "ask", "451": "something", "452": "hope", "453": "well", "454": "havent", "455": "long", "456": "so", "457": "far", "458": "week", "459": "did", "460": "wake", "461": "up", "462": "creation", "463": "automation", "464": "electronic", "465": "device", "466": "storing", "467": "useful", "468": "derived", "469": "knowledge", "470": "automatic", "471": "make", "472": "decisions", "473": "analyzing", "474": "medium", "475": "automatable", "476": "rules", "477": "activity", "478": "identifying", "479": "patterns", "480": "representation", "481": "be", "482": "executed", "483": "orders", "484": "using", "485": "executing", "486": "solving", "487": "problems", "488": "commands", "489": "ordered", "490": "model", "491": "logically", "492": "solve", "493": "problem", "494": "series", "495": "written", "496": "interpret", "497": "running", "498": "most", "499": "common", "500": "complexity", "501": "specific", "502": "format", "503": "structure", "504": "modify", "505": "optimize", "506": "efficiency", "507": "compare", "508": "methods", "509": "method", "510": "appropriate", "511": "technique", "512": "logic", "513": "statement", "514": "statements", "515": "loops", "516": "syntax", "517": "program", "518": "translate", "519": "object", "520": "oriented", "521": "objectoriented", "522": "\u200b\u200bused", "523": "disadvantages", "524": "features", "525": "intelligence", "526": "mobile", "527": "development", "528": "nonsql", "529": "communicate", "530": "databases", "531": "relational", "532": "nonrelational", "533": "schema", "534": "differences", "535": "compiler", "536": "interpreter", "537": "primitive", "538": "composite", "539": "list", "540": "dictionary", "541": "tuple", "542": "boolean", "543": "null", "544": "value", "545": "floating", "546": "integer", "547": "complex", "548": "function"}, "word_index": {"que": 1, "what": 2, "is": 3, "es": 4, "a": 5, "un": 6, "de": 7, "you": 8, "are": 9, "of": 10, "me": 11, "does": 12, "the": 13, "una": 14, "significa": 15, "mean": 16, "hola": 17, "to": 18, "an": 19, "hello": 20, "it": 21, "for": 22, "en": 23, "para": 24, "algoritmo": 25, "can": 26, "in": 27, "algorithm": 28, "ejemplos": 29, "examples": 30, "puedes": 31, "son": 32, "se": 33, "c": 34, "hay": 35, "python": 36, "frameworks": 37, "and": 38, "give": 39, "used": 40, "y": 41, "how": 42, "darme": 43, "lenguaje": 44, "lenguajes": 45, "java": 46, "language": 47, "languages": 48, "como": 49, "la": 50, "instrucciones": 51, "entre": 52, "between": 53, "diferencia": 54, "do": 55, "utiliza": 56, "react": 57, "frontend": 58, "backend": 59, "instructions": 60, "data": 61, "difference": 62, "datos": 63, "have": 64, "programming": 65, "which": 66, "las": 67, "programacion": 68, "cuales": 69, "los": 70, "algoritmos": 71, "while": 72, "sql": 73, "tipo": 74, "dato": 75, "good": 76, "algorithms": 77, "type": 78, "tal": 79, "javascript": 80, "flask": 81, "spring": 82, "angular": 83, "mongodb": 84, "your": 85, "time": 86, "tell": 87, "exist": 88, "estas": 89, "dia": 90, "no": 91, "usan": 92, "conjunto": 93, "tipos": 94, "existen": 95, "bucle": 96, "nivel": 97, "base": 98, "help": 99, "im": 100, "day": 101, "there": 102, "code": 103, "set": 104, "types": 105, "loop": 106, "level": 107, "database": 108, "bien": 109, "buenas": 110, "hey": 111, "hora": 112, "estoy": 113, "chiste": 114, "facebook": 115, "social": 116, "tu": 117, "codigo": 118, "sirve": 119, "quicksort": 120, "tiene": 121, "scripting": 122, "ruby": 123, "kotlin": 124, "swift": 125, "rust": 126, "go": 127, "django": 128, "hibernate": 129, "redis": 130, "joke": 131, "todo": 132, "te": 133, "tienes": 134, "dime": 135, "hoy": 136, "pajaros": 137, "por": 138, "hace": 139, "el": 140, "disponible": 141, "pasos": 142, "caracteristicas": 143, "instruccion": 144, "bajo": 145, "alto": 146, "ventajas": 147, "name": 148, "today": 149, "birds": 150, "we": 151, "available": 152, "steps": 153, "repetitive": 154, "greedy": 155, "dynamic": 156, "low": 157, "high": 158, "compiled": 159, "interpreted": 160, "advantages": 161, "buenos": 162, "dias": 163, "llamas": 164, "cuentame": 165, "otro": 166, "pajaro": 167, "redes": 168, "sociales": 169, "conectar": 170, "twitter": 171, "gimnasio": 172, "zumba": 173, "cual": 174, "ayudar": 175, "va": 176, "tiempo": 177, "hablamos": 178, "computadora": 179, "procesar": 180, "informacion": 181, "tarea": 182, "digital": 183, "transformar": 184, "repetitiva": 185, "realizar": 186, "tareas": 187, "estructurada": 188, "ordenes": 189, "software": 190, "resolver": 191, "con": 192, "escribir": 193, "logica": 194, "ordenamiento": 195, "voraces": 196, "dinamicos": 197, "elegir": 198, "entrada": 199, "salida": 200, "dame": 201, "compilados": 202, "interpretados": 203, "objetos": 204, "framework": 205, "artificial": 206, "boot": 207, "vue": 208, "qt": 209, "flutter": 210, "native": 211, "html": 212, "css": 213, "spa": 214, "nodejs": 215, "api": 216, "rest": 217, "graphql": 218, "full": 219, "stack": 220, "developer": 221, "relacional": 222, "mysql": 223, "postgresql": 224, "server": 225, "cassandra": 226, "bug": 227, "debugger": 228, "variable": 229, "array": 230, "string": 231, "char": 232, "recursion": 233, "morning": 234, "sorry": 235, "another": 236, "bird": 237, "networks": 238, "why": 239, "gym": 240, "hi": 241, "everything": 242, "afternoon": 243, "doing": 244, "been": 245, "talked": 246, "hows": 247, "going": 248, "i": 249, "was": 250, "computer": 251, "process": 252, "information": 253, "task": 254, "organized": 255, "transform": 256, "perform": 257, "tasks": 258, "structured": 259, "with": 260, "write": 261, "defined": 262, "characteristics": 263, "recursive": 264, "sorting": 265, "sequential": 266, "instruction": 267, "choose": 268, "conditional": 269, "input": 270, "output": 271, "functional": 272, "\u200b\u200bare": 273, "ayudarme": 274, "adios": 275, "nos": 276, "vemos": 277, "algun": 278, "nombre": 279, "quien": 280, "eres": 281, "hacer": 282, "gracias": 283, "perdon": 284, "lo": 285, "siento": 286, "ayuda": 287, "triste": 288, "feliz": 289, "red": 290, "personas": 291, "compartir": 292, "abeja": 293, "abejas": 294, "hacen": 295, "animado": 296, "maravilla": 297, "tenemos": 298, "si": 299, "sigues": 300, "ayudas": 301, "ayudame": 302, "escuchas": 303, "tardes": 304, "noches": 305, "haces": 306, "cuentas": 307, "ahi": 308, "hablar": 309, "puedo": 310, "preguntarte": 311, "algo": 312, "tarde": 313, "has": 314, "estado": 315, "espero": 316, "estes": 317, "mucho": 318, "hasta": 319, "ahora": 320, "semana": 321, "amaneciste": 322, "existes": 323, "creacion": 324, "automatizar": 325, "dispositivo": 326, "electronico": 327, "almacenar": 328, "util": 329, "conocimiento": 330, "derivado": 331, "automatica": 332, "organizados": 333, "tomar": 334, "decisiones": 335, "analizar": 336, "medio": 337, "automatizable": 338, "reglas": 339, "organizadas": 340, "actividad": 341, "identificar": 342, "patrones": 343, "representacion": 344, "ser": 345, "ejecutadas": 346, "mediante": 347, "ejecutando": 348, "problemas": 349, "modelo": 350, "ordenado": 351, "definido": 352, "manera": 353, "problema": 354, "serie": 355, "escritos": 356, "interpretar": 357, "ejecutar": 358, "recursivo": 359, "recursivos": 360, "mas": 361, "comunes": 362, "complejidad": 363, "voraz": 364, "dinamico": 365, "secuencial": 366, "formato": 367, "especifico": 368, "estructura": 369, "definida": 370, "modificar": 371, "optimizar": 372, "eficiencia": 373, "comparar": 374, "metodos": 375, "metodo": 376, "tecnica": 377, "adecuada": 378, "secuenciales": 379, "condicional": 380, "condicionales": 381, "repetitivas": 382, "bucles": 383, "sintaxis": 384, "programa": 385, "codificar": 386, "traducir": 387, "compilado": 388, "interpretado": 389, "e": 390, "orientado": 391, "orientados": 392, "funcional": 393, "funcionales": 394, "desventajas": 395, "inteligencia": 396, "desarrollo": 397, "movil": 398, "comunican": 399, "bases": 400, "esquema": 401, "usa": 402, "diferencias": 403, "compilador": 404, "interprete": 405, "primitivo": 406, "compuesto": 407, "lista": 408, "programaci\u00f3n": 409, "diccionario": 410, "tupla": 411, "booleano": 412, "valor": 413, "nulo": 414, "flotante": 415, "entero": 416, "complejo": 417, "funcion": 418, "all": 419, "bye": 420, "see": 421, "any": 422, "who": 423, "thank": 424, "aid": 425, "sad": 426, "happy": 427, "network": 428, "people": 429, "share": 430, "connecting": 431, "connect": 432, "dont": 433, "use": 434, "bee": 435, "bees": 436, "on": 437, "encouraged": 438, "wonderful": 439, "yeah": 440, "still": 441, "things": 442, "fine": 443, "listening": 444, "night": 445, "whats": 446, "its": 447, "since": 448, "talk": 449, "ask": 450, "something": 451, "hope": 452, "well": 453, "havent": 454, "long": 455, "so": 456, "far": 457, "week": 458, "did": 459, "wake": 460, "up": 461, "creation": 462, "automation": 463, "electronic": 464, "device": 465, "storing": 466, "useful": 467, "derived": 468, "knowledge": 469, "automatic": 470, "make": 471, "decisions": 472, "analyzing": 473, "medium": 474, "automatable": 475, "rules": 476, "activity": 477, "identifying": 478, "patterns": 479, "representation": 480, "be": 481, "executed": 482, "orders": 483, "using": 484, "executing": 485, "solving": 486, "problems": 487, "commands": 488, "ordered": 489, "model": 490, "logically": 491, "solve": 492, "problem": 493, "series": 494, "written": 495, "interpret": 496, "running": 497, "most": 498, "common": 499, "complexity": 500, "specific": 501, "format": 502, "structure": 503, "modify": 504, "optimize": 505, "efficiency": 506, "compare": 507, "methods": 508, "method": 509, "appropriate": 510, "technique": 511, "logic": 512, "statement": 513, "statements": 514, "loops": 515, "syntax": 516, "program": 517, "translate": 518, "object": 519, "oriented": 520, "objectoriented": 521, "\u200b\u200bused": 522, "disadvantages": 523, "features": 524, "intelligence": 525, "mobile": 526, "development": 527, "nonsql": 528, "communicate": 529, "databases": 530, "relational": 531, "nonrelational": 532, "schema": 533, "differences": 534, "compiler": 535, "interpreter": 536, "primitive": 537, "composite": 538, "list": 539, "dictionary": 540, "tuple": 541, "boolean": 542, "null": 543, "value": 544, "floating": 545, "integer": 546, "complex": 547, "function": 548}}, "max_length": 11}