{"class_name": "Tokenizer", "config": {"num_words": 3000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 20, "word_counts": "{\"hola\": 1, \"buenos\": 1, \"d\\u00edas\": 1, \"buenas\": 1, \"tardes\": 1, \"\\u00bfqu\\u00e9\": 4, \"tal\": 1, \"\\u00bfc\\u00f3mo\": 1, \"est\\u00e1s\": 1, \"\\u00bfme\": 1, \"puedes\": 2, \"ayudar\": 1, \"necesito\": 1, \"ayuda\": 1, \"ay\\u00fadame\": 1, \"hacer\": 1, \"cu\\u00e9ntame\": 2, \"un\": 1, \"chiste\": 2, \"dime\": 2, \"algo\": 2, \"divertido\": 1, \"hazme\": 1, \"re\\u00edr\": 1, \"\\u00bfsabes\": 2, \"alg\\u00fan\": 1, \"\\u00bfqui\\u00e9n\": 1, \"es\": 2, \"tu\": 1, \"superh\\u00e9roe\": 1, \"favorito\": 1, \"\\u00bfte\": 1, \"gustan\": 1, \"los\": 1, \"superh\\u00e9roes\": 2, \"de\": 2, \"python\": 1, \"lenguaje\": 1, \"programaci\\u00f3n\": 2, \"usas\": 1, \"programar\": 1, \"sobre\": 1}", "word_docs": "{\"hola\": 1, \"d\\u00edas\": 1, \"buenos\": 1, \"buenas\": 1, \"tardes\": 1, \"\\u00bfqu\\u00e9\": 4, \"tal\": 1, \"\\u00bfc\\u00f3mo\": 1, \"est\\u00e1s\": 1, \"puedes\": 2, \"ayudar\": 1, \"\\u00bfme\": 1, \"ayuda\": 1, \"necesito\": 1, \"ay\\u00fadame\": 1, \"hacer\": 1, \"un\": 1, \"chiste\": 2, \"cu\\u00e9ntame\": 2, \"divertido\": 1, \"algo\": 2, \"dime\": 2, \"hazme\": 1, \"re\\u00edr\": 1, \"alg\\u00fan\": 1, \"\\u00bfsabes\": 2, \"favorito\": 1, \"\\u00bfqui\\u00e9n\": 1, \"superh\\u00e9roe\": 1, \"tu\": 1, \"es\": 2, \"los\": 1, \"superh\\u00e9roes\": 2, \"gustan\": 1, \"\\u00bfte\": 1, \"de\": 2, \"python\": 1, \"lenguaje\": 1, \"programaci\\u00f3n\": 2, \"usas\": 1, \"programar\": 1, \"sobre\": 1}", "index_docs": "{\"12\": 1, \"14\": 1, \"13\": 1, \"15\": 1, \"16\": 1, \"1\": 4, \"17\": 1, \"18\": 1, \"19\": 1, \"2\": 2, \"21\": 1, \"20\": 1, \"23\": 1, \"22\": 1, \"24\": 1, \"25\": 1, \"26\": 1, \"4\": 2, \"3\": 2, \"27\": 1, \"6\": 2, \"5\": 2, \"28\": 1, \"29\": 1, \"30\": 1, \"7\": 2, \"34\": 1, \"31\": 1, \"33\": 1, \"32\": 1, \"8\": 2, \"37\": 1, \"9\": 2, \"36\": 1, \"35\": 1, \"10\": 2, \"38\": 1, \"39\": 1, \"11\": 2, \"40\": 1, \"41\": 1, \"42\": 1}", "index_word": "{\"1\": \"\\u00bfqu\\u00e9\", \"2\": \"puedes\", \"3\": \"cu\\u00e9ntame\", \"4\": \"chiste\", \"5\": \"dime\", \"6\": \"algo\", \"7\": \"\\u00bfsabes\", \"8\": \"es\", \"9\": \"superh\\u00e9roes\", \"10\": \"de\", \"11\": \"programaci\\u00f3n\", \"12\": \"hola\", \"13\": \"buenos\", \"14\": \"d\\u00edas\", \"15\": \"buenas\", \"16\": \"tardes\", \"17\": \"tal\", \"18\": \"\\u00bfc\\u00f3mo\", \"19\": \"est\\u00e1s\", \"20\": \"\\u00bfme\", \"21\": \"ayudar\", \"22\": \"necesito\", \"23\": \"ayuda\", \"24\": \"ay\\u00fadame\", \"25\": \"hacer\", \"26\": \"un\", \"27\": \"divertido\", \"28\": \"hazme\", \"29\": \"re\\u00edr\", \"30\": \"alg\\u00fan\", \"31\": \"\\u00bfqui\\u00e9n\", \"32\": \"tu\", \"33\": \"superh\\u00e9roe\", \"34\": \"favorito\", \"35\": \"\\u00bfte\", \"36\": \"gustan\", \"37\": \"los\", \"38\": \"python\", \"39\": \"lenguaje\", \"40\": \"usas\", \"41\": \"programar\", \"42\": \"sobre\"}", "word_index": "{\"\\u00bfqu\\u00e9\": 1, \"puedes\": 2, \"cu\\u00e9ntame\": 3, \"chiste\": 4, \"dime\": 5, \"algo\": 6, \"\\u00bfsabes\": 7, \"es\": 8, \"superh\\u00e9roes\": 9, \"de\": 10, \"programaci\\u00f3n\": 11, \"hola\": 12, \"buenos\": 13, \"d\\u00edas\": 14, \"buenas\": 15, \"tardes\": 16, \"tal\": 17, \"\\u00bfc\\u00f3mo\": 18, \"est\\u00e1s\": 19, \"\\u00bfme\": 20, \"ayudar\": 21, \"necesito\": 22, \"ayuda\": 23, \"ay\\u00fadame\": 24, \"hacer\": 25, \"un\": 26, \"divertido\": 27, \"hazme\": 28, \"re\\u00edr\": 29, \"alg\\u00fan\": 30, \"\\u00bfqui\\u00e9n\": 31, \"tu\": 32, \"superh\\u00e9roe\": 33, \"favorito\": 34, \"\\u00bfte\": 35, \"gustan\": 36, \"los\": 37, \"python\": 38, \"lenguaje\": 39, \"usas\": 40, \"programar\": 41, \"sobre\": 42}"}}